/**
 *****************************************
 * Created by edonet@163.com
 * Created on 2018-07-11 17:04:30
 *****************************************
 */
'use strict';


/**
 *****************************************
 * 添加模块
 *****************************************
 */
import uuid from '../lib/uuid';


/**
 *****************************************
 * 测试模块
 *****************************************
 */
describe('测试【uuid】', () => {
    test('创建【uuid】', () => {
        let map = {},
            i = 1000;

        // 校验1000个互不相等的【id】
        while (i --) {
            let id = uuid();

            // 校验不存在当前【id】
            expect(map[id]).toBeUndefined();

            // 添加【id】
            map[id] = true;
        }
    });
});
