/**
 *****************************************
 * Created by edonet@163.com
 * Created on 2018-11-14 21:43:22
 *****************************************
 */
'use strict';


/**
 *****************************************
 * 加载依赖
 *****************************************
 */
const isFunction = require('./isFunction');


/**
 *****************************************
 * 创建调用链
 *****************************************
 */
function chain(...args) {

    // 过滤非函数参数
    args = args.filter(fn => isFunction(fn));

    // 返回链条函数
    return args.reduceRight((next, fn) => argv => fn(argv, next), x => x);
}


/**
 *****************************************
 * 抛出接口
 *****************************************
 */
module.exports = chain;
