/**
 *****************************************
 * Created by edonet@163.com
 * Created on 2018-07-14 09:29:48
 *****************************************
 */
'use strict';


/**
 *****************************************
 * 定义常量
 *****************************************
 */
const WEEK_ZH = ['日', '一', '二', '三', '四', '五', '六'];
const WEEK_EN = ['Sunday', 'Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday'];
const MONTH = ['January', 'February', 'March', 'April', 'May', 'June', 'July', 'August', 'September', 'October', 'November', 'December'];



/**
 *****************************************
 * 获取年份的四位数
 *****************************************
 */
export function Y(date) {
    return date.getFullYear();
}


/**
 *****************************************
 * 获取年份的二位数
 *****************************************
 */
export function y(date) {
    return date.getFullYear() % 100;
}


/**
 *****************************************
 * 获取月份的完整的英文表示
 *****************************************
 */
export function F(date) {
    return MONTH[date.getMonth()];
}


/**
 *****************************************
 * 获取月份的短英文表示（用三个字母表示）
 *****************************************
 */
export function M(date) {
    return F(date).slice(0, 3);
}


/**
 *****************************************
 * 获取月份的数字表示（从 01 到 12）
 *****************************************
 */
export function m(date) {
    return zeroed(n(date));
}


/**
 *****************************************
 * 获取月份的数字表示，不带前导零（1 到 12）
 *****************************************
 */
export function n(date) {
    return date.getMonth() + 1;
}


/**
 *****************************************
 * 获取月份中一共有多少天
 *****************************************
 */
export function t(date) {
    return (new Date(date.getFullYear(), date.getMonth() + 1, 0)).getDate();
}


/**
 *****************************************
 * 获取一个月中的第几天（从 01 到 31）
 *****************************************
 */
export function d(date) {
    return zeroed(j(date));
}


/**
 *****************************************
 * 获取一个月中的第几天，不带前导零（1 到 31）
 *****************************************
 */
export function j(date) {
    return date.getDate();
}


/**
 *****************************************
 * 获取一个月中的第几天的英语序数后缀（2 个字符：st、nd、rd 或 th。与 j 搭配使用）
 *****************************************
 */
export function e(date) {
    return ['th', 'st', 'nd', 'rd'][date.getDate()] || 'th';
}


/**
 *****************************************
 * 获取星期几的完整的英文表示
 *****************************************
 */
export function L(date) {
    return '星期' + WEEK_ZH[date.getDay()];
}


/**
 *****************************************
 * 获取星期几的完整的英文表示
 *****************************************
 */
export function l(date) {
    return WEEK_EN[date.getDay()];
}


/**
 *****************************************
 * 获取星期几的完整的英文表示
 *****************************************
 */
export function D(date) {
    return l(date).slice(0, 3);
}


/**
 *****************************************
 * 获取星期几（1 表示星期一，7 表示星期日）
 *****************************************
 */
export function N(date) {
    return date.getDay() || 7;
}


/**
 *****************************************
 * 获取星期几（1 表示星期一，0 表示星期日）
 *****************************************
 */
export function w(date) {
    return date.getDay();
}


/**
 *****************************************
 * 获取小时（24 小时制，带前导零）
 *****************************************
 */
export function H(date) {
    return zeroed(G(date));
}


/**
 *****************************************
 * 获取小时（12 小时制，带前导零）
 *****************************************
 */
export function h(date) {
    return zeroed(g(date));
}


/**
 *****************************************
 * 获取小时（24 小时制，不带前导零）
 *****************************************
 */
export function G(date) {
    return date.getHours();
}


/**
 *****************************************
 * 获取小时（12 小时制，不带前导零）
 *****************************************
 */
export function g(date) {
    return G(date) % 12;
}


/**
 *****************************************
 * 获取分钟，不带前导零
 *****************************************
 */
export function I(date) {
    return date.getMinutes();
}


/**
 *****************************************
 * 获取分钟，带前导零
 *****************************************
 */
export function i(date) {
    return zeroed(date.getMinutes());
}


/**
 *****************************************
 * 获取秒，带前导零
 *****************************************
 */
export function S(date) {
    return date.getSeconds();
}


/**
 *****************************************
 * 获取秒，带前导零
 *****************************************
 */
export function s(date) {
    return zeroed(date.getSeconds());
}


/**
 *****************************************
 * 获取毫秒，不带前导零
 *****************************************
 */
export function U(date) {
    return date.getMilliseconds();
}


/**
 *****************************************
 * 获取毫秒，带前导零
 *****************************************
 */
export function u(date) {
    return ('00' + date.getMilliseconds()).slice(-3);
}

/**
 *****************************************
 * 获取小写形式表示：am 或 pm
 *****************************************
 */
export function a(date) {
    return date.getHours() > 12 ? 'pm' : 'am';
}


/**
 *****************************************
 * 获取大写形式表示：AM 或 PM
 *****************************************
 */
export function A(date) {
    return date.getHours() > 12 ? 'PM' : 'AM';
}


/**
 *****************************************
 * 添加前导零
 *****************************************
 */
export function zeroed(val) {
    return val > 9 ? '' + val : '0' + val;
}












